<a href="https://colab.research.google.com/github/JamesExeter/PandasPlayAround/blob/main/PandasWalkthrough.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [248]:
import numpy as np 
import pandas as pd

values = np.array([2.0, 5.0, 1.0, 0.97, 3.0, 10.0, 0.0599, 8.0]) # create an np array

ser = pd.Series(values) # create a series from the values array
print(ser)

0     2.0000
1     5.0000
2     1.0000
3     0.9700
4     3.0000
5    10.0000
6     0.0599
7     8.0000
dtype: float64

In [249]:
labels = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H']

ser2 = pd.Series(data=values, index=labels)
print(ser2)

A     2.0000
B     5.0000
C     1.0000
D     0.9700
E     3.0000
F    10.0000
G     0.0599
H     8.0000
dtype: float64

In [250]:
movie_rating = {
    'age': 1,
    'gender': 'F',
    'genres': 'Drama',
    'movie_id': 1193,
    'occupation': 10,
    'rating': 5,
    'timestamp': 978300760,
    'title': "One Flew Over the Cuckoo's Next (1975)",
    'user_id': 1,
    'zip': '48067'
}

movie_ser = pd.Series(movie_rating)
print(movie_ser)

ser.values

age                                                1
gender                                             F
genres                                         Drama
movie_id                                        1193
occupation                                        10
rating                                             5
timestamp                                  978300760
title         One Flew Over the Cuckoo's Next (1975)
user_id                                            1
zip                                            48067
dtype: object

array([ 2.    ,  5.    ,  1.    ,  0.97  ,  3.    , 10.    ,  0.0599,
        8.    ])

In [251]:
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)

print("Index:", df.index)
print("Column:", df.columns)

d2 = {'one' : [1., 2., 3., 4.],
    'two' : [1., 2., 3., 4.]}

df2 = pd.DataFrame(d2)
df2

d3 = [{'a':1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df3 = pd.DataFrame(d3)
df3

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
Index: Index(['a', 'b', 'c', 'd'], dtype='object')
Column: Index(['one', 'two'], dtype='object')

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [252]:
import seaborn as sns

# would download the csv data and read through pd.read_csv
iris_df = sns.load_dataset('iris')
iris_df.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [253]:
iris_df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [254]:
random_df = pd.DataFrame(np.random.randn(10,4), columns = ['A', 'B', 'C', 'D'])
random_df.info()
random_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
 3   D       10 non-null     float64
dtypes: float64(4)
memory usage: 448.0 bytes

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.397403   0.172179   0.188817   0.424589
std     0.697498   0.897561   0.951322   1.123141
min    -1.419126  -1.163059  -0.982100  -0.848321
25%    -0.926608  -0.527090  -0.313033  -0.312478
50%    -0.380593   0.359750  -0.214195  -0.052356
75%     0.149470   0.478627   1.147834   0.903124
max     0.529174   1.556562   1.479299   2.714435

In [255]:
random_df

          A         B         C         D
0 -0.244945  0.093408 -0.982100 -0.393131
1  0.529174 -0.733923 -0.313808  0.973052
2 -1.419126  0.492798  1.479299 -0.848321
3  0.261659  0.436115  1.384875  0.086195
4 -0.699820 -0.952809 -0.217674  2.714435
5 -0.516241 -1.163059 -0.970889 -0.190907
6 -1.213143  1.556562 -0.310708  0.693341
7  0.517712  1.273199  0.749161  1.806399
8 -1.002204  0.400229  1.280725 -0.267812
9 -0.187097  0.319272 -0.210715 -0.327367

In [256]:
print(df.max())
print("=========================")
print(df.max(axis=1))

print(df.idxmax(axis=0))
print("=========================")
print(df.idxmin(axis=0))
print("=========================")
print(df.idxmax(axis=1))
print("=========================")
print(df.idxmin(axis=1))

one    3.0
two    4.0
dtype: float64
=========================
a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64
one    c
two    d
dtype: object
=========================
one    a
two    a
dtype: object
=========================
a    one
b    one
c    one
d    two
dtype: object
=========================
a    one
b    one
c    one
d    two
dtype: object

In [257]:
d4 = {'one' : [1., 1., 2., 4.],
    'two' :  [1., 2., 3., 4.]}
df4= pd.DataFrame(d4)
df4

df4['one'].value_counts()

1.0    2
4.0    1
2.0    1
Name: one, dtype: int64

In [258]:
df4['one'].unique()

array([1., 2., 4.])

In [259]:
data = np.random.randint(0, 10, size=(3,3))
frame = pd.DataFrame(data, index=['r1', 'r2', 'r3'], columns = ['c1', 'c2', 'c3'])

frame

    c1  c2  c3
r1   5   3   8
r2   0   4   2
r3   4   0   1

In [260]:
frame['c1']

r1    5
r2    0
r3    4
Name: c1, dtype: int64

In [261]:
frame.c1

r1    5
r2    0
r3    4
Name: c1, dtype: int64

In [262]:
frame['c1']['r2']

0

In [263]:
slice_df = frame[['c1','c2']]
slice_df

    c1  c2
r1   5   3
r2   0   4
r3   4   0

In [264]:
frame.loc['r1']

c1    5
c2    3
c3    8
Name: r1, dtype: int64

In [265]:
frame.loc[['r1', 'r2']]

    c1  c2  c3
r1   5   3   8
r2   0   4   2

In [266]:
frame.loc[['r1', 'r2'], ['c1', 'c2']]

    c1  c2
r1   5   3
r2   0   4

In [267]:
frame.loc['r1':'r3','c1':'c3']

    c1  c2  c3
r1   5   3   8
r2   0   4   2
r3   4   0   1

In [268]:
frame.iloc[:2, :2]

    c1  c2
r1   5   3
r2   0   4

In [269]:
frame

    c1  c2  c3
r1   5   3   8
r2   0   4   2
r3   4   0   1

In [270]:
frame[frame['c1']>0]

    c1  c2  c3
r1   5   3   8
r3   4   0   1

In [271]:
frame < 5

       c1    c2     c3
r1  False  True  False
r2   True  True   True
r3   True  True   True

In [272]:
frame[frame<5] = -1
frame

    c1  c2  c3
r1   5  -1   8
r2  -1  -1  -1
r3  -1  -1  -1

In [273]:
deep_df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, columns=['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'])

deep_df

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [274]:
deep_df.index = [
        "Canada",
        "France",
        "Germany",
        "Italy",
        "Japan",
        "United Kingdon",
        "United States"
]

deep_df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdon      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [275]:
deep_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Canada to United States
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [276]:
deep_df.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429
std     97.249970  5.494020e+06  4.576187e+06  0.016592
min     35.467000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.914000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [277]:
deep_df.loc['Canada']

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [278]:
deep_df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdon      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [279]:
deep_df.iloc[-1]

Population       318.523
GDP             17348075
Surface Area     9525067
HDI                0.915
Continent        America
Name: United States, dtype: object

In [280]:
deep_df['Population']

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdon     64.511
United States     318.523
Name: Population, dtype: float64

In [281]:
deep_df[['Population', 'GDP']]

                Population       GDP
Canada              35.467   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdon      64.511   2950039
United States      318.523  17348075

In [282]:
deep_df[1:3]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [283]:
deep_df.loc['Italy']

Population       60.665
GDP             2167744
Surface Area     301336
HDI               0.873
Continent        Europe
Name: Italy, dtype: object

In [284]:
deep_df.loc['France':'Italy']

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe
Italy        60.665  2167744        301336  0.873    Europe

In [285]:
deep_df.loc['France':'Italy', ['Population', 'GDP']]

         Population      GDP
France       63.951  2833687
Germany      80.940  3874437
Italy        60.665  2167744

In [286]:
deep_df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdon      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [287]:
deep_df.iloc[[0, 1, -1]]

               Population       GDP  Surface Area    HDI Continent
Canada             35.467   1785387       9984670  0.913   America
France             63.951   2833687        640679  0.888    Europe
United States     318.523  17348075       9525067  0.915   America

In [288]:
deep_df.iloc[1:3]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [289]:
deep_df.iloc[1:3, 3]

France     0.888
Germany    0.916
Name: HDI, dtype: float64

In [290]:
deep_df.iloc[1:3, [0,3]]

         Population    HDI
France       63.951  0.888
Germany      80.940  0.916

In [291]:
deep_df.iloc[1:3, 1:3]

             GDP  Surface Area
France   2833687        640679
Germany  3874437        357114

In [292]:
deep_df['Population']>70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdon    False
United States      True
Name: Population, dtype: bool

In [293]:
deep_df.loc[deep_df['Population']>70]

               Population       GDP  Surface Area    HDI Continent
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [294]:
deep_df.loc[deep_df['Population']>70, 'Population']

Germany           80.940
Japan            127.061
United States    318.523
Name: Population, dtype: float64

In [295]:
deep_df.loc[deep_df['Population']>70, ['Population', 'GDP']]

               Population       GDP
Germany            80.940   3874437
Japan             127.061   4602367
United States     318.523  17348075

In [296]:
population = deep_df['Population']
population.min(), population.max()

(35.467, 318.523)

In [297]:
population.sum()

751.118

In [298]:
population.sum() / len(population)

107.30257142857144

In [299]:
population.mean()

107.30257142857144

In [300]:
population.median()

64.511

In [301]:
deep_df_copy = deep_df.copy()

deep_df.drop('Canada', inplace= True)
deep_df

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdon      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [302]:
deep_df = deep_df_copy.copy()
deep_df.drop(['Canada', 'Japan'])

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
United Kingdon      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [303]:
deep_df = deep_df_copy.copy()
deep_df.drop(columns=['Population', 'HDI'])

                     GDP  Surface Area Continent
Canada           1785387       9984670   America
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdon   2950039        242495    Europe
United States   17348075       9525067   America

In [304]:
deep_df = deep_df_copy.copy()
deep_df.drop(['Italy', 'Canada'], axis=0)

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdon      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [305]:
deep_df = deep_df_copy.copy()
deep_df.drop(['Population', 'HDI'], axis=1)

                     GDP  Surface Area Continent
Canada           1785387       9984670   America
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdon   2950039        242495    Europe
United States   17348075       9525067   America

In [306]:
langs = pd.Series(
    ['French', 'German', 'Italian'],
    index = ['France', 'Germany', 'Italy'],
    name = 'Language'
)

langs

France      French
Germany     German
Italy      Italian
Name: Language, dtype: object

In [307]:
deep_df['Language'] = langs
deep_df

                Population       GDP  Surface Area    HDI Continent Language
Canada              35.467   1785387       9984670  0.913   America      NaN
France              63.951   2833687        640679  0.888    Europe   French
Germany             80.940   3874437        357114  0.916    Europe   German
Italy               60.665   2167744        301336  0.873    Europe  Italian
Japan              127.061   4602367        377930  0.891      Asia      NaN
United Kingdon      64.511   2950039        242495  0.907    Europe      NaN
United States      318.523  17348075       9525067  0.915   America      NaN

In [308]:
deep_df['Language'] = "English"
deep_df

                Population       GDP  Surface Area    HDI Continent Language
Canada              35.467   1785387       9984670  0.913   America  English
France              63.951   2833687        640679  0.888    Europe  English
Germany             80.940   3874437        357114  0.916    Europe  English
Italy               60.665   2167744        301336  0.873    Europe  English
Japan              127.061   4602367        377930  0.891      Asia  English
United Kingdon      64.511   2950039        242495  0.907    Europe  English
United States      318.523  17348075       9525067  0.915   America  English

In [309]:
deep_df['GDP per Capita'] = deep_df['GDP'] / deep_df['Population']
deep_df

                Population       GDP  ...  Language  GDP per Capita
Canada              35.467   1785387  ...   English    50339.385908
France              63.951   2833687  ...   English    44310.284437
Germany             80.940   3874437  ...   English    47868.013343
Italy               60.665   2167744  ...   English    35733.025633
Japan              127.061   4602367  ...   English    36221.712406
United Kingdon      64.511   2950039  ...   English    45729.239975
United States      318.523  17348075  ...   English    54464.120330

[7 rows x 7 columns]

In [310]:
deep_df.rename(
    columns={
        'HDI': 'Human Development Index',
        'Anual Popcorn Consumption': 'APC'
    }, index={
        'United States': 'USA',
        'United Kingdom': 'UK',
        'Argentina': 'AR'
    })

deep_df # not working

                Population       GDP  ...  Language  GDP per Capita
Canada              35.467   1785387  ...   English    50339.385908
France              63.951   2833687  ...   English    44310.284437
Germany             80.940   3874437  ...   English    47868.013343
Italy               60.665   2167744  ...   English    35733.025633
Japan              127.061   4602367  ...   English    36221.712406
United Kingdon      64.511   2950039  ...   English    45729.239975
United States      318.523  17348075  ...   English    54464.120330

[7 rows x 7 columns]

In [311]:
deep_df.rename(index=str.upper) # not working
deep_df.rename(index=lambda x: x.lower()) # not working
deep_df

                Population       GDP  ...  Language  GDP per Capita
Canada              35.467   1785387  ...   English    50339.385908
France              63.951   2833687  ...   English    44310.284437
Germany             80.940   3874437  ...   English    47868.013343
Italy               60.665   2167744  ...   English    35733.025633
Japan              127.061   4602367  ...   English    36221.712406
United Kingdon      64.511   2950039  ...   English    45729.239975
United States      318.523  17348075  ...   English    54464.120330

[7 rows x 7 columns]

In [312]:
deep_df.append(pd.Series({
    'Population': 3,
    'GDP': 5
}, name='China'))

deep_df.loc['China'] = pd.Series({'Population': 1_400_000_000, 'Continent': 'Asia'})
deep_df

                  Population         GDP  ...  Language  GDP per Capita
Canada          3.546700e+01   1785387.0  ...   English    50339.385908
France          6.395100e+01   2833687.0  ...   English    44310.284437
Germany         8.094000e+01   3874437.0  ...   English    47868.013343
Italy           6.066500e+01   2167744.0  ...   English    35733.025633
Japan           1.270610e+02   4602367.0  ...   English    36221.712406
United Kingdon  6.451100e+01   2950039.0  ...   English    45729.239975
United States   3.185230e+02  17348075.0  ...   English    54464.120330
China           1.400000e+09         NaN  ...       NaN             NaN

[8 rows x 7 columns]

In [313]:
deep_df.reset_index()
deep_df.set_index('Population')

                     GDP  Surface Area  ...  Language GDP per Capita
Population                              ...
3.546700e+01   1785387.0     9984670.0  ...   English   50339.385908
6.395100e+01   2833687.0      640679.0  ...   English   44310.284437
8.094000e+01   3874437.0      357114.0  ...   English   47868.013343
6.066500e+01   2167744.0      301336.0  ...   English   35733.025633
1.270610e+02   4602367.0      377930.0  ...   English   36221.712406
6.451100e+01   2950039.0      242495.0  ...   English   45729.239975
3.185230e+02  17348075.0     9525067.0  ...   English   54464.120330
1.400000e+09         NaN           NaN  ...       NaN            NaN

[8 rows x 6 columns]

In [314]:
deep_df.sort_values('Population', ascending=False).head(10)

                  Population         GDP  ...  Language  GDP per Capita
China           1.400000e+09         NaN  ...       NaN             NaN
United States   3.185230e+02  17348075.0  ...   English    54464.120330
Japan           1.270610e+02   4602367.0  ...   English    36221.712406
Germany         8.094000e+01   3874437.0  ...   English    47868.013343
United Kingdon  6.451100e+01   2950039.0  ...   English    45729.239975
France          6.395100e+01   2833687.0  ...   English    44310.284437
Italy           6.066500e+01   2167744.0  ...   English    35733.025633
Canada          3.546700e+01   1785387.0  ...   English    50339.385908

[8 rows x 7 columns]

In [315]:
help(df.groupby)

Help on method groupby in module pandas.core.frame:

groupby(by=None, axis=0, level=None, as_index:bool=True, sort:bool=True, group_keys:bool=True, squeeze:bool=<object object at 0x7f8dac548df0>, observed:bool=False, dropna:bool=True) -> 'DataFrameGroupBy' method of pandas.core.frame.DataFrame instance
    Group DataFrame using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, or list of labels
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If an ndarray is passed, the
        values are used as-is determine the groups. A label or list of
        labels may be passed to group by the columns in ``self``. Notice
        that a tuple is interpreted as a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1).
    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels.
    as_index : bool, default True
        For aggregated output, return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output.
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group.
    group_keys : bool, default True
        When calling apply, add group keys to index to identify pieces.
    squeeze : bool, default False
        Reduce the dimensionality of the return type if possible,
        otherwise return a consistent type.

        .. deprecated:: 1.1.0

    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionadded:: 0.23.0
    dropna : bool, default True
        If True, and if group keys contain NA values, NA values together
        with row/column will be dropped.
        If False, NA values will also be treated as the key in groups

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrameGroupBy
        Returns a groupby object that contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <https://pandas.pydata.org/pandas-docs/stable/groupby.html>`_ for more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Captive', 'Wild', 'Captive', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
    ...                   index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Captive      390.0
           Wild         350.0
    Parrot Captive       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level="Type").mean()
             Max Speed
    Type
    Captive      210.0
    Wild         185.0

    We can also choose to include NA in group keys or not by setting
    `dropna` parameter, the default setting is `True`:

    >>> l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by=["b"]).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5

    >>> df.groupby(by=["b"], dropna=False).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5
    NaN 1   4

    >>> l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by="a").sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0

    >>> df.groupby(by="a", dropna=False).sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0
    NaN 12.3   33.0

In [316]:
grouping_df = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
                            'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
                            'c': np.random.randn(7)})

grouping_df

       a  b         c
0    one  x -0.937131
1    one  y -0.361294
2    two  y -0.762536
3  three  x  0.511916
4    two  y  0.359787
5    one  x -1.395425
6    six  x  0.262444

In [317]:
grouping_df.groupby('a')

In [320]:
grouping_df.groupby('a').mean()

              c
a
one   -0.897950
six    0.262444
three  0.511916
two   -0.201375

In [321]:
grouping_df.groupby(['a', 'b']).mean()

                c
a     b
one   x -1.166278
      y -0.361294
six   x  0.262444
three x  0.511916
two   y -0.201375

In [322]:
wh = pd.read_csv("https://www.cs.helsinki.fi/u/jttoivon/dap/data/fmi/kumpula-weather-2017.csv")
wh.describe()

         Year           m  ...  Snow depth (cm)  Air temperature (degC)
count   365.0  365.000000  ...       358.000000              365.000000
mean   2017.0    6.526027  ...         0.966480                6.527123
std       0.0    3.452584  ...         3.717472                7.183934
min    2017.0    1.000000  ...        -1.000000              -17.800000
25%    2017.0    4.000000  ...        -1.000000                1.200000
50%    2017.0    7.000000  ...        -1.000000                4.800000
75%    2017.0   10.000000  ...         0.000000               12.900000
max    2017.0   12.000000  ...        15.000000               19.600000

[8 rows x 6 columns]

In [323]:
wh['Snow depth (cm)'].unique()

array([-1.,  7., 13., 10., 12.,  9.,  8.,  5.,  6.,  4.,  3., 15., 14.,
        2., nan,  0.])

In [324]:
wh['Snow depth (cm)'].value_counts()

-1.0     263
 8.0      17
 6.0      14
 5.0      13
 7.0      10
 0.0       8
 4.0       6
 3.0       5
 10.0      5
 13.0      5
 2.0       4
 9.0       3
 12.0      3
 14.0      1
 15.0      1
Name: Snow depth (cm), dtype: int64

In [325]:
wh.isnull()

      Year      m  ...  Snow depth (cm)  Air temperature (degC)
0    False  False  ...            False                   False
1    False  False  ...            False                   False
2    False  False  ...            False                   False
3    False  False  ...            False                   False
4    False  False  ...            False                   False
..     ...    ...  ...              ...                     ...
360  False  False  ...            False                   False
361  False  False  ...            False                   False
362  False  False  ...            False                   False
363  False  False  ...            False                   False
364  False  False  ...            False                   False

[365 rows x 8 columns]

In [326]:
wh[wh.isnull().any(axis=1)]

     Year   m  ...  Snow depth (cm) Air temperature (degC)
74   2017   3  ...              NaN                    3.4
163  2017   6  ...              NaN                   12.6
308  2017  11  ...              NaN                    8.4
309  2017  11  ...              NaN                    7.5
313  2017  11  ...              NaN                    7.2
321  2017  11  ...              NaN                    5.9
328  2017  11  ...              NaN                    4.2

[7 rows x 8 columns]

In [327]:
wh.dropna().shape

(358, 8)

In [328]:
wh.dropna(axis=1).shape

(365, 7)

In [329]:
wh.fillna(method="ffill", inplace=True)
wh[wh.isnull().any(axis=1)]

Empty DataFrame
Columns: [Year, m, d, Time, Time zone, Precipitation amount (mm), Snow depth (cm), Air temperature (degC)]
Index: []

In [330]:
wh.to_csv("weather_modified.csv", index=None)